Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD10_DFP/2.5.53/Microchip.SAMD10_DFP.pdsc
      <condition id="ATSAMD10C14A">
         <require Dvendor="Microchip:3" Dname="ATSAMD10C14A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMD10D14AS">
         <require Dvendor="Microchip:3" Dname="ATSAMD10D14AS"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.5.0" condition="ATSAMD10D14AM">
         <description>Headers and startup code for Microchip ATSAMD10D14AM</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd10d14am.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd10d14am.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd10d14am_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd10d14am_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd10d14am.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd10d14am.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd10d14am.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd10d14am.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd10d14am/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd10d14am/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.5.0" condition="ATSAMD10D13AM">
         <description>Headers and startup code for Microchip ATSAMD10D13AM</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd10d13am.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd10d13am.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd10d13am_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd10d13am_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd10d13am.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd10d13am.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd10d13am.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd10d13am.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd10d13am/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd10d13am/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.5.0" condition="ATSAMD10C13A">
         <description>Headers and startup code for Microchip ATSAMD10C13A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd10c13a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd10c13a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd10c13a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd10c13a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd10c13a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd10c13a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd10c13a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd10c13a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd10c13a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd10c13a/flash.icf" attr="config"/>
         </files>
      </component>
