Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD10_DFP/2.5.53/Microchip.SAMD10_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.5.0" condition="ATSAMD10D13AS">
         <description>Headers and startup code for Microchip ATSAMD10D13AS</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd10d13as.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd10d13as.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd10d13as_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd10d13as_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd10d13as.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd10d13as.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd10d13as.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd10d13as.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd10d13as/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd10d13as/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.5.0" condition="ATSAMD10D14AU">
         <description>Headers and startup code for Microchip ATSAMD10D14AU</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd10d14au.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd10d14au.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd10d14au_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd10d14au_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd10d14au.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd10d14au.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd10d14au.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd10d14au.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd10d14au/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd10d14au/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.5.0" condition="ATSAMD10C14A">
         <description>Headers and startup code for Microchip ATSAMD10C14A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd10c14a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd10c14a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd10c14a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd10c14a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd10c14a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd10c14a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd10c14a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd10c14a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd10c14a/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd10c14a/flash.icf" attr="config"/>
         </files>
      </component>
