Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD10_DFP/2.5.53/Microchip.SAMD10_DFP.pdsc
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.5.0" condition="ATSAMD10D14AS">
         <description>Headers and startup code for Microchip ATSAMD10D14AS</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samd10d14as.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samd10d14as.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samd10d14as_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samd10d14as_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samd10d14as.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samd10d14as.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samd10d14as.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samd10d14as.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/config/linker/Microchip/atsamd10d14as/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/config/linker/Microchip/atsamd10d14as/flash.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
